--------------------------------------------------------------------------------
-- Proof rules on the indirection modality and the precursors
--------------------------------------------------------------------------------

{-# OPTIONS --without-K --sized-types #-}

module Symp.Logic.Ind where

open import Base.Func using (_$_; _∘_; id; const)
open import Base.Size using (𝕊; Thunk; ¡_; !; _$ᵀʰ_)
open import Base.Nat using (ℕ)
open import Symp.Lang.Expr using (Type; Expr∞)
open import Symp.Lang.Ktxred using (Redex)
open import Symp.Logic.Prop using (HorKind; SProp∞; SProp˂∞; ¡ᴾ_; ∀-syntax; _∗_;
  _-∗_; □_; ○_; _⊸[_]⇛_; _⊸[_]ᵃ⟨_⟩_; _⊸⟨_⟩[_]_; _⊸⟨_⟩ᴾ_; _⊸⟨_⟩ᵀ[_]_; _⊸[_]⟨_⟩∞;
  Basic)
open import Symp.Logic.Core using (_⊢[_]_; _⊢[<_]_; Pers; ⇒<; ⊢-refl; _»_;
  ∗-comm; ∗-elimʳ; ⊤∗-intro; -∗-monoʳ; -∗-elimˡ; -∗-const; Pers-⇒□)
open import Symp.Logic.Fupd using ([_]⇛_; _⊢[_][_]⇛_; _⊢[<_][_]⇛_; _⊢[<_][_]⇛ᴺ_;
  ⇒⇛; _ᵘ»_; _»ᵘᴺ_; ⇛⇒⇛ᴺ)

-- Import and re-export
open import Symp.Logic.Judg public using (○-mono; ○-eatˡ; ○-new; □○-new-rec;
  ○-use; ⊸⇛-≤; ⊸⇛-eatˡ⁻ˡᵘ; ⊸⇛-monoʳᵘ; ⊸⇛-eatˡ⁻ʳ; ⊸⇛-frameʳ; ○⇒⊸⇛; ⊸⇛-use;
  ⊸ᵃ⟨⟩-≤; ⊸ᵃ⟨⟩-eatˡ⁻ˡᵘ; ⊸ᵃ⟨⟩-monoʳᵘ; ⊸ᵃ⟨⟩-eatˡ⁻ʳ; ⊸ᵃ⟨⟩-frameʳ; ○⇒⊸ᵃ⟨⟩; ⊸ᵃ⟨⟩-use;
  ⊸⟨⟩ᵀ⇒⊸⟨⟩ᴾ; ⊸⟨⟩ᵀ-≤; ⊸⟨⟩-eatˡ⁻ˡᵘᴺ; ⊸⟨⟩-monoʳᵘᴺ; ⊸⟨⟩-eatˡ⁻ʳ; ⊸⟨⟩-frameʳ; ○⇒⊸⟨⟩;
  ⊸⟨⟩ᴾ-use; ⊸⟨⟩ᵀ-use; ⊸⟨⟩∞-≤; ⊸⟨⟩∞-eatˡ⁻ᵘᴺ; ○⇒⊸⟨⟩∞; ⊸⟨⟩∞-use)

private variable
  ι :  𝕊
  i j :  ℕ
  T :  Type
  P Q R :  SProp∞
  P˂ P'˂ Q˂ Q'˂ R˂ :  SProp˂∞
  X Y :  Set₀
  x :  X
  Q˙ :  X → SProp∞
  P˂˙ Q˂˙ Q'˂˙ :  X → SProp˂∞
  Q˂˙˙ :  X → Y → SProp˂∞
  κ :  HorKind
  red :  Redex T
  e :  Expr∞ T

abstract

  ------------------------------------------------------------------------------
  -- On ○

  -->  ○-mono :  P˂ .! ⊢[< ι ] Q˂ .! →  ○ P˂ ⊢[ ι ] ○ Q˂

  -->  ○-use :  ○ P˂ ⊢[ ι ][ i ]⇛ P˂ .!

  -- Let ○ eat a basic proposition

  -->  ○-eatˡ :  {{Basic Q}} →  Q ∗ ○ P˂ ⊢[ ι ] ○ ¡ᴾ (Q ∗ P˂ .!)

  ○-eatʳ :  {{Basic Q}} →  ○ P˂ ∗ Q ⊢[ ι ] ○ ¡ᴾ (P˂ .! ∗ Q)
  ○-eatʳ =  ∗-comm » ○-eatˡ » ○-mono $ ⇒< ∗-comm

  -- Get ○

  -->  ○-new :  P˂ .! ⊢[ ι ][ i ]⇛ ○ P˂

  -->  □○-new-rec :  □ ○ P˂ -∗ □ P˂ .! ⊢[ ι ][ i ]⇛ □ ○ P˂

  □○-new-rec-Pers :  {{Pers (P˂ .!)}} →  □ ○ P˂ -∗ P˂ .! ⊢[ ι ][ i ]⇛ □ ○ P˂
  □○-new-rec-Pers =  -∗-monoʳ Pers-⇒□ » □○-new-rec

  □○-new :  □ P˂ .! ⊢[ ι ][ i ]⇛ □ ○ P˂
  □○-new =  -∗-const » □○-new-rec

  □○-new-Pers :  {{Pers (P˂ .!)}} →  P˂ .! ⊢[ ι ][ i ]⇛ □ ○ P˂
  □○-new-Pers =  Pers-⇒□ » □○-new

  ------------------------------------------------------------------------------
  -- On ⊸⇛

  -->  ○⇒⊸⇛ :  P˂ .!  ∗  R˂ .!  ⊢[< ι ][ i ]⇛  Q˂ .!  →
  -->          ○ R˂  ⊢[ ι ]  P˂ ⊸[ i ]⇛ Q˂

  -->  ⊸⇛-use :  P˂ .!  ∗  (P˂ ⊸[ i ]⇛ Q˂)  ⊢[ ι ][ ṡ i ]⇛  Q˂ .!

  -- Modify ⇛ proof

  -->  ⊸⇛-≤ :  i ≤ j  →   P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]  P˂ ⊸[ j ]⇛ Q˂

  -->  ⊸⇛-eatˡ⁻ˡᵘ :  {{Basic R}}  →   R  ∗  P'˂ .!  ⊢[< ι ][ i ]⇛  P˂ .! →
  -->                R  ∗  (P˂ ⊸[ i ]⇛ Q˂)  ⊢[ ι ]  P'˂ ⊸[ i ]⇛ Q˂

  ⊸⇛-monoˡᵘ :  P'˂ .! ⊢[< ι ][ i ]⇛ P˂ .! →
               P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]  P'˂ ⊸[ i ]⇛ Q˂
  ⊸⇛-monoˡᵘ P'⊢⇛P =  ⊤∗-intro » ⊸⇛-eatˡ⁻ˡᵘ $ (∗-elimʳ »_) $ᵀʰ P'⊢⇛P

  ⊸⇛-eatˡ⁻ˡ :  {{Basic R}}  →
    R ∗ (P˂ ⊸[ i ]⇛ Q˂)  ⊢[ ι ]  ¡ᴾ (R -∗ P˂ .!) ⊸[ i ]⇛ Q˂
  ⊸⇛-eatˡ⁻ˡ =  ⊸⇛-eatˡ⁻ˡᵘ $ ⇒< $ ⇒⇛ $ -∗-elimˡ ⊢-refl

  ⊸⇛-monoˡ :  P'˂ .! ⊢[< ι ] P˂ .! →
              P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]  P'˂ ⊸[ i ]⇛ Q˂
  ⊸⇛-monoˡ P'⊢P =  ⊸⇛-monoˡᵘ $ ⇒⇛ $ᵀʰ P'⊢P

  -->  ⊸⇛-monoʳᵘ :  Q˂ .!  ⊢[< ι ][ i ]⇛  Q'˂ .! →
  -->               P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]  P˂ ⊸[ i ]⇛ Q'˂

  ⊸⇛-monoʳ :  Q˂ .!  ⊢[< ι ]  Q'˂ .!  →
              P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]  P˂ ⊸[ i ]⇛ Q'˂
  ⊸⇛-monoʳ Q⊢Q' =  ⊸⇛-monoʳᵘ $ ⇒⇛ $ᵀʰ Q⊢Q'

  -->  ⊸⇛-eatˡ⁻ʳ :  {{Basic R}}  →
  -->    R  ∗  (P˂ ⊸[ i ]⇛ Q˂)  ⊢[ ι ]  P˂ ⊸[ i ]⇛ ¡ᴾ (R ∗ Q˂ .!)

  -->  ⊸⇛-frameʳ :  P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]
  -->                 ¡ᴾ (R ∗ P˂ .!) ⊸[ i ]⇛ ¡ᴾ (R ∗ Q˂ .!)

  ⊸⇛-frameˡ :  P˂ ⊸[ i ]⇛ Q˂  ⊢[ ι ]  ¡ᴾ (P˂ .! ∗ R) ⊸[ i ]⇛ ¡ᴾ (Q˂ .! ∗ R)
  ⊸⇛-frameˡ =  ⊸⇛-frameʳ » ⊸⇛-monoˡ (⇒< ∗-comm) » ⊸⇛-monoʳ $ ⇒< ∗-comm

  ------------------------------------------------------------------------------
  -- On ⊸ᵃ⟨ ⟩

  -->  ○⇒⊸ᵃ⟨⟩ :  P˂ .!  ∗  R˂ .!  ⊢[< ι ][ i ]ᵃ⟨ red ⟩ (λ v →  Q˂˙ v .!)  →
  -->            ○ R˂  ⊢[ ι ]  P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙

  -->  ⊸ᵃ⟨⟩-use :  P˂ .!  ∗  (P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙)
  -->                ⊢[ ι ][ ṡ i ]ᵃ⟨ red ⟩ λ v →  Q˂˙ v .!

  -- Modify ⟨ ⟩ᵀ proof

  -->  ⊸ᵃ⟨⟩-≤ :  i ≤ j  →   P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]  P˂ ⊸[ j ]ᵃ⟨ red ⟩ Q˂˙

  -->  ⊸ᵃ⟨⟩-eatˡ⁻ˡᵘ :  {{Basic R}}  →   R  ∗  P'˂ .!  ⊢[< ι ][ j ]⇛  P˂ .!  →
  -->    R ∗ (P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙)  ⊢[ ι ]  P'˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙

  ⊸ᵃ⟨⟩-monoˡᵘ :  P'˂ .! ⊢[< ι ][ i ]⇛ P˂ .! →
                 P˂ ⊸[ j ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]  P'˂ ⊸[ j ]ᵃ⟨ red ⟩ Q˂˙
  ⊸ᵃ⟨⟩-monoˡᵘ P'⊢⇛P =  ⊤∗-intro » ⊸ᵃ⟨⟩-eatˡ⁻ˡᵘ $ (∗-elimʳ »_) $ᵀʰ P'⊢⇛P

  ⊸ᵃ⟨⟩-eatˡ⁻ˡ :  {{Basic R}}  →
    R ∗ (P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙)  ⊢[ ι ]  ¡ᴾ (R -∗ P˂ .!) ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙
  ⊸ᵃ⟨⟩-eatˡ⁻ˡ =  ⊸ᵃ⟨⟩-eatˡ⁻ˡᵘ {i = 0} $ ⇒< $ ⇒⇛ $ -∗-elimˡ ⊢-refl

  ⊸ᵃ⟨⟩-monoˡ :  P'˂ .! ⊢[< ι ] P˂ .! →
                P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]  P'˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙
  ⊸ᵃ⟨⟩-monoˡ P'⊢P =  ⊸ᵃ⟨⟩-monoˡᵘ {i = 0} $ ⇒⇛ $ᵀʰ P'⊢P

  -->  ⊸ᵃ⟨⟩-monoʳᵘ :  (∀ v →  Q˂˙ v .!  ⊢[< ι ][ i ]⇛  Q'˂˙ v .!)  →
  -->                 P˂ ⊸[ j ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]  P˂ ⊸[ j ]ᵃ⟨ red ⟩ Q'˂˙

  ⊸ᵃ⟨⟩-monoʳ :  (∀ v →  Q˂˙ v .!  ⊢[< ι ]  Q'˂˙ v .!)  →
                P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]  P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q'˂˙
  ⊸ᵃ⟨⟩-monoʳ Qv⊢Q'v =  ⊸ᵃ⟨⟩-monoʳᵘ {i = 0} λ v → ⇒⇛ $ᵀʰ Qv⊢Q'v v

  -->  ⊸ᵃ⟨⟩-eatˡ⁻ʳ :  {{Basic R}}  →
  -->    R  ∗  (P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙)  ⊢[ ι ]
  -->      P˂ ⊸[ i ]ᵃ⟨ red ⟩ λ v → ¡ᴾ (R ∗ Q˂˙ v .!)

  -->  ⊸ᵃ⟨⟩-frameʳ :  P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]
  -->                  ¡ᴾ (R ∗ P˂ .!) ⊸[ i ]ᵃ⟨ red ⟩ λ v → ¡ᴾ (R ∗ Q˂˙ v .!)

  ⊸ᵃ⟨⟩-frameˡ :  P˂ ⊸[ i ]ᵃ⟨ red ⟩ Q˂˙  ⊢[ ι ]
                   ¡ᴾ (P˂ .! ∗ R) ⊸[ i ]ᵃ⟨ red ⟩ λ v → ¡ᴾ (Q˂˙ v .! ∗ R)
  ⊸ᵃ⟨⟩-frameˡ =  ⊸ᵃ⟨⟩-frameʳ »
    ⊸ᵃ⟨⟩-monoˡ (⇒< ∗-comm) » ⊸ᵃ⟨⟩-monoʳ λ _ → ⇒< ∗-comm

  ------------------------------------------------------------------------------
  -- On ⊸⟨ ⟩

  -->  ⊸⟨⟩ᵀ⇒⊸⟨⟩ᴾ :  P˂ ⊸⟨ e ⟩ᵀ[ i ] Q˂˙  ⊢[ ι ]  P˂ ⊸⟨ e ⟩ᴾ Q˂˙

  -->  ○⇒⊸⟨⟩ :  P˂ .!  ∗  R˂ .!  ⊢[< ι ]⟨ e ⟩[ κ ] (λ v →  Q˂˙ v .!)  →
  -->           ○ R˂  ⊢[ ι ]  P˂ ⊸⟨ e ⟩[ κ ] Q˂˙

  -->  ⊸⟨⟩ᴾ-use :  e ⇒ᴾ e'  →
  -->    P˂ .!  ∗  (P˂ ⊸⟨ e' ⟩ᴾ Q˂˙)  ⊢[ ι ]⟨ e ⟩ᴾ λ v →  Q˂˙ v .!

  -->  ⊸⟨⟩ᵀ-use :  P˂ .!  ∗  (P˂ ⊸⟨ e ⟩ᵀ[ i ] Q˂˙)
  -->                ⊢[ ι ]⟨ e ⟩ᵀ[ ṡ i ] λ v →  Q˂˙ v .!

  -- Modify ⟨ ⟩ proof

  -->  ⊸⟨⟩ᵀ-≤ :  i ≤ j  →   P˂ ⊸⟨ e ⟩ᵀ[ i ] Q˂˙  ⊢[ ι ]  P˂ ⊸⟨ e ⟩ᵀ[ j ] Q˂˙

  -->  ⊸⟨⟩-eatˡ⁻ˡᵘᴺ :  {{Basic R}}  →   R  ∗  P'˂ .!  ⊢[< ι ][ i ]⇛ᴺ  P˂ .!  →
  -->                  R  ∗  (P˂ ⊸⟨ e ⟩[ κ ] Q˂˙)  ⊢[ ι ]  P'˂ ⊸⟨ e ⟩[ κ ] Q˂˙

  ⊸⟨⟩-eatˡ⁻ˡᵘ :  {{Basic R}}  →   R  ∗  P'˂ .!  ⊢[< ι ][ i ]⇛  P˂ .!  →
                 R  ∗  (P˂ ⊸⟨ e ⟩[ κ ] Q˂˙)  ⊢[ ι ]  P'˂ ⊸⟨ e ⟩[ κ ] Q˂˙
  ⊸⟨⟩-eatˡ⁻ˡᵘ =  ⊸⟨⟩-eatˡ⁻ˡᵘᴺ ∘ (⇛⇒⇛ᴺ $ᵀʰ_)

  ⊸⟨⟩-eatˡ⁻ˡ :  {{Basic R}}  →
    R  ∗  (P˂ ⊸⟨ e ⟩[ κ ] Q˂˙)  ⊢[ ι ]  ¡ᴾ (R -∗ P˂ .!) ⊸⟨ e ⟩[ κ ] Q˂˙
  ⊸⟨⟩-eatˡ⁻ˡ =  ⊸⟨⟩-eatˡ⁻ˡᵘ {i = 0} $ ⇒< $ ⇒⇛ $ -∗-elimˡ ⊢-refl

  ⊸⟨⟩-monoˡᵘᴺ :  P'˂ .!  ⊢[< ι ][ i ]⇛ᴺ  P˂ .!  →
                 P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]  P'˂ ⊸⟨ e ⟩[ κ ] Q˂˙
  ⊸⟨⟩-monoˡᵘᴺ P'⊢⇛P =  ⊤∗-intro » ⊸⟨⟩-eatˡ⁻ˡᵘᴺ $ (∗-elimʳ »ᵘᴺ_) $ᵀʰ P'⊢⇛P

  ⊸⟨⟩-monoˡᵘ :  P'˂ .!  ⊢[< ι ][ i ]⇛  P˂ .!  →
                P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]  P'˂ ⊸⟨ e ⟩[ κ ] Q˂˙
  ⊸⟨⟩-monoˡᵘ =  ⊸⟨⟩-monoˡᵘᴺ ∘ (⇛⇒⇛ᴺ $ᵀʰ_)

  ⊸⟨⟩-monoˡ :  P'˂ .! ⊢[< ι ] P˂ .! →
               P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]  P'˂ ⊸⟨ e ⟩[ κ ] Q˂˙
  ⊸⟨⟩-monoˡ =  ⊸⟨⟩-monoˡᵘ {i = 0} ∘ (⇒⇛ $ᵀʰ_)

  -->  ⊸⟨⟩-monoʳᵘᴺ :  (∀ v →  Q˂˙ v .!  ⊢[< ι ][ i ]⇛ᴺ  Q'˂˙ v .!)  →
  -->                 P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]  P˂ ⊸⟨ e ⟩[ κ ] Q'˂˙

  ⊸⟨⟩-monoʳᵘ :  (∀ v →  Q˂˙ v .!  ⊢[< ι ][ i ]⇛  Q'˂˙ v .!)  →
                P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]  P˂ ⊸⟨ e ⟩[ κ ] Q'˂˙
  ⊸⟨⟩-monoʳᵘ Qv⊢⇛Q'v =  ⊸⟨⟩-monoʳᵘᴺ λ v → ⇛⇒⇛ᴺ $ᵀʰ Qv⊢⇛Q'v v

  ⊸⟨⟩-monoʳ :  (∀ v →  Q˂˙ v .!  ⊢[< ι ]  Q'˂˙ v .!)  →
               P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]  P˂ ⊸⟨ e ⟩[ κ ] Q'˂˙
  ⊸⟨⟩-monoʳ Qv⊢Q'v =  ⊸⟨⟩-monoʳᵘ {i = 0} λ v → ⇒⇛ $ᵀʰ Qv⊢Q'v v

  -->  ⊸⟨⟩-eatˡ⁻ʳ :  {{Basic R}}  →
  -->    R  ∗  (P˂ ⊸⟨ e ⟩[ κ ] Q˂˙)  ⊢[ ι ]
  -->      P˂ ⊸⟨ e ⟩[ κ ] λ v → ¡ᴾ (R ∗ Q˂˙ v .!)

  -->  ⊸⟨⟩-frameʳ :  P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]
  -->                  ¡ᴾ (R ∗ P˂ .!) ⊸⟨ e ⟩[ κ ] λ v → ¡ᴾ (R ∗ Q˂˙ v .!)

  ⊸⟨⟩-frameˡ :  P˂ ⊸⟨ e ⟩[ κ ] Q˂˙  ⊢[ ι ]
                  ¡ᴾ (P˂ .! ∗ R) ⊸⟨ e ⟩[ κ ] λ v → ¡ᴾ (Q˂˙ v .! ∗ R)
  ⊸⟨⟩-frameˡ =  ⊸⟨⟩-frameʳ » ⊸⟨⟩-monoˡ (⇒< ∗-comm) » ⊸⟨⟩-monoʳ λ _ → ⇒< ∗-comm

  ------------------------------------------------------------------------------
  -- On ⊸⟨ ⟩∞

  -- Modify ⟨ ⟩ proof

  -->  ⊸⟨⟩∞-≤ :  i ≤ j  →   P˂ ⊸[ i ]⟨ e ⟩∞  ⊢[ ι ]  P˂ ⊸[ j ]⟨ e ⟩∞

  -->  ⊸⟨⟩∞-eatˡ⁻ᵘᴺ :  {{Basic R}}  →   R  ∗  Q˂ .!  ⊢[< ι ][ i ]⇛ᴺ  P˂ .!  →
  -->                  R  ∗  (P˂ ⊸[ j ]⟨ e ⟩∞)  ⊢[ ι ]  Q˂ ⊸[ j ]⟨ e ⟩∞

  ⊸⟨⟩∞-eatˡ⁻ᵘ :  {{Basic R}}  →   R  ∗  Q˂ .!  ⊢[< ι ][ i ]⇛  P˂ .!  →
                 R  ∗  (P˂ ⊸[ j ]⟨ e ⟩∞)  ⊢[ ι ]  Q˂ ⊸[ j ]⟨ e ⟩∞
  ⊸⟨⟩∞-eatˡ⁻ᵘ =  ⊸⟨⟩∞-eatˡ⁻ᵘᴺ ∘ (⇛⇒⇛ᴺ $ᵀʰ_)

  ⊸⟨⟩∞-eatˡ :  {{Basic R}}  →
    R  ∗  (P˂ ⊸[ i ]⟨ e ⟩∞)  ⊢[ ι ]  ¡ᴾ (R -∗ P˂ .!) ⊸[ i ]⟨ e ⟩∞
  ⊸⟨⟩∞-eatˡ =  ⊸⟨⟩∞-eatˡ⁻ᵘ {i = 0} $ ⇒< $ ⇒⇛ $ -∗-elimˡ ⊢-refl

  ⊸⟨⟩∞-monoᵘᴺ :  Q˂ .!  ⊢[< ι ][ i ]⇛ᴺ  P˂ .!  →
                 P˂ ⊸[ j ]⟨ e ⟩∞  ⊢[ ι ]  Q˂ ⊸[ j ]⟨ e ⟩∞
  ⊸⟨⟩∞-monoᵘᴺ Q⊢⇛P =  ⊤∗-intro » ⊸⟨⟩∞-eatˡ⁻ᵘᴺ $ (∗-elimʳ »ᵘᴺ_) $ᵀʰ Q⊢⇛P

  ⊸⟨⟩∞-monoᵘ :  Q˂ .!  ⊢[< ι ][ i ]⇛  P˂ .!  →
                P˂ ⊸[ j ]⟨ e ⟩∞  ⊢[ ι ]  Q˂ ⊸[ j ]⟨ e ⟩∞
  ⊸⟨⟩∞-monoᵘ =  ⊸⟨⟩∞-monoᵘᴺ ∘ (⇛⇒⇛ᴺ $ᵀʰ_)

  ⊸⟨⟩∞-mono :  Q˂ .!  ⊢[< ι ]  P˂ .!  →
               P˂ ⊸[ i ]⟨ e ⟩∞  ⊢[ ι ]  Q˂ ⊸[ i ]⟨ e ⟩∞
  ⊸⟨⟩∞-mono =  ⊸⟨⟩∞-monoᵘ {i = 0} ∘ (⇒⇛ $ᵀʰ_)
